[
  {
    "role": "Frontend Developer",
    "organisation": "Paper & Co.",
    "startDate": "Apr, 2022",
    "endDate": "Nov 2023",
    "experiences": [
      "Developed accurate technical documentation to ensure clear understanding of development processes, resulting in an increase in team efficiency by 20%.",
      "Prioritized workload effectively and managed multiple tasks simultaneously, leading to timely and efficient delivery of projects with a 95% on-time completion rate.",
      "Collaborated with the Quality Assurance team to ensure optimal user experience and functionality for web design projects, resulting in a 98% client satisfaction rate."
    ],
    "imageSrc": "history/Paper.png"
  },
  {
    "role": "QA Engineer",
    "organisation": "Dawn Info Tek Inc.",
    "startDate": "Mar, 2016",
    "endDate": "Jun, 2018",
    "experiences": [
      "Developed and executed comprehensive test plans, including unit tests, integration tests, and end-to-end tests, resulting in a 20% increase in software reliability.",
      "Collaborated with the development team to identify and resolve defects and issues, resulting in a 15% decrease in post-release bug reports.",
      "Participated in technical discussions to provide valuable feedback on technical solutions for software products, contributing to a 10% improvement in overall product functionality."
    ],
    "imageSrc": "history/DawnIcon.png"
  },
  {
    "role": "QA Engineer",
    "organisation": "Teleperformance",
    "startDate": "Nov, 2014",
    "endDate": "Jan, 2016",
    "experiences": [
      "Developed comprehensive test plans to identify and resolve software issues, resulting in a 30% decrease in bug reports from end-users.",
      "Documented and communicated test results to the software development team, facilitating quicker resolution of bugs and errors by 40%.",
      "Collaborated with the software development team to implement improvements based on user feedback, leading to a 20% increase in overall user satisfaction."
    ],
    "imageSrc": "history/netflix.png"
  }
]
