[
  {
    "role": "Frontend Developer",
    "organisation": "Paper & Co.",
    "startDate": "Apr, 2022",
    "endDate": "Nov 2023",
    "experiences": [
      "Engineered an educational platform connecting students with tutors, incorporating live chat functionalities and a custom math keyboard, significantly enhancing user interaction and educational support.",
      "Led the design and implementation of UI/UX improvements, increasing platform engagement by 30%.",
      "Conducted extensive testing using Cypress, ensuring robust application performance and leading to a 95% bug resolution rate prior to production."
    ],
    "imageSrc": "history/Paper.png"
  },
  {
    "role": "Software Developer ",
    "organisation": "Dawn Info Tek Inc.",
    "startDate": "Mar, 2016",
    "endDate": "Jun, 2018",
    "experiences": [
      "Collaborated closely with UI/UX designers and backend developers to enhance financial applications, focusing on automating payment calculations and optimizing the user journey",
      "Implemented test cases and coordinated with the backend team to ensure accurate data handling, reducing transaction errors by 40%.",
      "Spearheaded the redevelopment of customer-facing financial assessment tools, improving usability and customer satisfaction scores by 35%."
    ],
    "imageSrc": "history/DawnIcon.png"
  },
  {
    "role": "Junior Software Developer",
    "organisation": "Teleperformance",
    "startDate": "Nov, 2014",
    "endDate": "Jan, 2016",
    "experiences": [
      "Developed and maintained the Sling TV app, a multi-channel streaming service platform, enhancing user experience by integrating various international channels into one accessible interface.",
      "Improved application performance and scalability by implementing dynamic content loading and optimizing server interactions, which reduced buffering time by 25%.",
      "Collaborated in agile teams to roll out new features, such as package customization options, which increased customer retention by 20%."
    ],
    "imageSrc": "history/netflix.png"
  }
]
